Revit 2026 API

# ViewportViewId Property

---

The element id of the associated View.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ViewId { get; set; }
```
```vb
Public Property ViewId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member ViewId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace